#Question 1
Exploratory Data Analysis

In [121]:
import pandas as pd
import numpy as np
from scipy import stats

In [122]:
df = pd.read_csv("https://raw.githubusercontent.com/HunterAshby/ShopifyInternChallenge/main/2019%20Winter%20Data%20Science%20Intern%20Challenge%20Data%20Set%20-%20Sheet1.csv")

In [123]:
df.head()

   order_id  shop_id  user_id  ...  total_items  payment_method           created_at
0         1       53      746  ...            2            cash  2017-03-13 12:36:56
1         2       92      925  ...            1            cash  2017-03-03 17:38:52
2         3       44      861  ...            1            cash   2017-03-14 4:23:56
3         4       18      935  ...            1     credit_card  2017-03-26 12:43:37
4         5       18      883  ...            1     credit_card   2017-03-01 4:35:11

[5 rows x 7 columns]

In [124]:
aov = df["order_amount"].sum() / len(df)
aov

3145.128

In [125]:
df.loc[df["order_amount"] == df["order_amount"].max()]

      order_id  shop_id  ...  payment_method          created_at
15          16       42  ...     credit_card  2017-03-07 4:00:00
60          61       42  ...     credit_card  2017-03-04 4:00:00
520        521       42  ...     credit_card  2017-03-02 4:00:00
1104      1105       42  ...     credit_card  2017-03-24 4:00:00
1362      1363       42  ...     credit_card  2017-03-15 4:00:00
1436      1437       42  ...     credit_card  2017-03-11 4:00:00
1562      1563       42  ...     credit_card  2017-03-19 4:00:00
1602      1603       42  ...     credit_card  2017-03-17 4:00:00
2153      2154       42  ...     credit_card  2017-03-12 4:00:00
2297      2298       42  ...     credit_card  2017-03-07 4:00:00
2835      2836       42  ...     credit_card  2017-03-28 4:00:00
2969      2970       42  ...     credit_card  2017-03-28 4:00:00
3332      3333       42  ...     credit_card  2017-03-24 4:00:00
4056      4057       42  ...     credit_card  2017-03-28 4:00:00
4646      4647       42  ...     credit_card  2017-03-02 4:00:00
4868      4869       42  ...     credit_card  2017-03-22 4:00:00
4882      4883       42  ...     credit_card  2017-03-25 4:00:00

[17 rows x 7 columns]

In [126]:
df.loc[df["order_amount"] == df["order_amount"].min()]

      order_id  shop_id  ...  payment_method           created_at
1            2       92  ...            cash  2017-03-03 17:38:52
158        159       92  ...     credit_card   2017-03-29 3:07:12
228        229       92  ...           debit  2017-03-13 23:57:51
322        323       92  ...           debit   2017-03-08 3:49:15
590        591       92  ...           debit  2017-03-28 22:56:23
1843      1844       92  ...           debit   2017-03-06 7:01:09
2092      2093       92  ...           debit   2017-03-04 6:44:05
2503      2504       92  ...     credit_card   2017-03-28 2:30:26
3187      3188       92  ...     credit_card  2017-03-08 18:16:25
3200      3201       92  ...            cash  2017-03-25 15:14:50
3363      3364       92  ...     credit_card  2017-03-11 23:20:31
3871      3872       92  ...           debit   2017-03-18 9:10:08
4183      4184       92  ...           debit   2017-03-26 4:22:39
4219      4220       92  ...     credit_card  2017-03-25 20:16:58
4414      4415       92  ...     credit_card   2017-03-17 9:57:01
4760      4761       92  ...           debit   2017-03-20 7:37:28
4923      4924       92  ...     credit_card   2017-03-09 5:05:11
4932      4933       92  ...     credit_card   2017-03-24 2:17:13

[18 rows x 7 columns]

In [127]:
#Outliers are the culprit in this dataset, so we need to remove them

In [128]:
#This will drop anything 2 standard deviations away from the mean in the order amount column
df = df[(np.abs(stats.zscore(df["order_amount"])) < 2)]

In [129]:
aov = df["order_amount"].sum() / len(df)
aov

702.7484440875327

In [130]:
#The aov is still quite high, so here I am checkin to see the max value in the
#order amount column
df.loc[df["order_amount"] == df["order_amount"].max()]

      order_id  shop_id  ...  payment_method           created_at
1259      1260       78  ...     credit_card   2017-03-27 9:27:20
2564      2565       78  ...           debit   2017-03-25 1:19:35
2690      2691       78  ...           debit   2017-03-22 7:33:25
2906      2907       78  ...           debit   2017-03-16 3:45:46
3403      3404       78  ...           debit   2017-03-16 9:45:05
3724      3725       78  ...     credit_card  2017-03-16 14:13:26
4192      4193       78  ...     credit_card   2017-03-18 9:25:32
4420      4421       78  ...           debit  2017-03-09 15:21:35
4715      4716       78  ...           debit   2017-03-05 5:10:44

[9 rows x 7 columns]

In [131]:
#77175 is still unreasonably high so we run the SD drop again
df = df[(np.abs(stats.zscore(df["order_amount"])) < 2)]

In [132]:
#Now the aov seems to be a reasonable a value.
aov = df["order_amount"].sum() / len(df)
aov

302.58051448247926

In [133]:
#To make sure everything is good, I check the max value again
df.loc[df["order_amount"] == df["order_amount"].max()]

      order_id  shop_id  ...  payment_method          created_at
1364      1365       42  ...            cash  2017-03-10 6:28:21

[1 rows x 7 columns]

In [134]:
#I can now confidently report an aov of 302.58